# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dns-child-zone.azuread_application.cert_manager_app will be created
  + resource "azuread_application" "cert_manager_app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "corr-at22-cert-manager"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.dns-child-zone.azuread_application_federated_identity_credential.cert_manager_fed_identity will be created
  + resource "azuread_application_federated_identity_credential" "cert_manager_fed_identity" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "The federated identity used to federate K8s with Azure AD for corr-at22-cert-manager"
      + display_name   = "fed-identity-corr-at22-cert-manager"
      + id             = (known after apply)
      + issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/9a2c3489-7817-4ba0-9a4a-4600bb14b520/"
      + subject        = "system:serviceaccount:cert-manager:cert-manager"
    }

  # module.dns-child-zone.azuread_service_principal.cert_manager_sp will be created
  + resource "azuread_service_principal" "cert_manager_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.dns-child-zone.azurerm_dns_a_record.wildcard_record will be created
  + resource "azurerm_dns_a_record" "wildcard_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + records             = [
          + "20.251.17.51",
        ]
      + resource_group_name = "corr-at22-dns-rg"
      + ttl                 = 300
      + zone_name           = "at22.corr.altinn.cloud"
    }

  # module.dns-child-zone.azurerm_dns_aaaa_record.wildcard_record will be created
  + resource "azurerm_dns_aaaa_record" "wildcard_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + records             = [
          + "2603:1020:e01:d::2a",
        ]
      + resource_group_name = "corr-at22-dns-rg"
      + ttl                 = 300
      + zone_name           = "at22.corr.altinn.cloud"
    }

  # module.dns-child-zone.azurerm_dns_caa_record.issue_lets_encrypt will be created
  + resource "azurerm_dns_caa_record" "issue_lets_encrypt" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "corr-at22-dns-rg"
      + ttl                 = 300
      + zone_name           = "at22.corr.altinn.cloud"

      + record {
          + flags = 0
          + tag   = "issue"
          + value = "letsencrypt.org"
        }
      + record {
          + flags = 0
          + tag   = "issuewild"
          + value = "letsencrypt.org"
        }
    }

  # module.dns-child-zone.azurerm_dns_ns_record.child_zone will be created
  + resource "azurerm_dns_ns_record" "child_zone" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "at22.corr"
      + records             = (known after apply)
      + resource_group_name = "DNS"
      + ttl                 = 300
      + zone_name           = "altinn.cloud"
    }

  # module.dns-child-zone.azurerm_dns_zone.child_zone will be created
  + resource "azurerm_dns_zone" "child_zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "at22.corr.altinn.cloud"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "corr-at22-dns-rg"

      + soa_record (known after apply)
    }

  # module.dns-child-zone.azurerm_resource_group.dns_child_zone_rg will be created
  + resource "azurerm_resource_group" "dns_child_zone_rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "corr-at22-dns-rg"
    }

  # module.dns-child-zone.azurerm_role_assignment.dns_zone_contributor_cert_manager will be created
  + resource "azurerm_role_assignment" "dns_zone_contributor_cert_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.infra-resources.azapi_resource.cert_manager_issuer[0] will be created
  + resource "azapi_resource" "cert_manager_issuer" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + tls-issuer = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + AZURE_DNS_ZONE_NAME   = "at22.corr.altinn.cloud"
                              + AZURE_RESOURCE_GROUP  = "corr-at22-dns-rg"
                              + AZURE_SUBSCRIPTION_ID = "cc6b5886-36af-4d54-9d30-1b0fffc736d8"
                              + IDENTITY_CLIENT_ID    = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/cert-manager-dns-issuer"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "tls-issuer"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2025-04-01"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/altinn-correspondence-test/corr-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/corr-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_corr-at22-aks-rg.tfstate.tfplan` |